
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	newdoc.Ссылка КАК AAAA
		|ИЗ
		|	Документ.newdoc КАК newdoc";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//ИзменениеНачало
	//Сообщить("При установке нового");
	//ИзменениеКонец
	//Сообщение = Новый СообщениеПользователю;
	//Сообщение.Текст = "Новое изменение";
	//Сообщение.Поле = "";
	//Сообщение.УстановитьДанные();
	//Сообщение.Сообщить();
	///asdasd/asd/ads/d/ad
//new commit


	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Сообщить("На помойку");
КонецПроцедуры
